# !/usr/local/bin python
# -*- coding:utf-8 -+-


##########################################
# map関連の設定
##########################################
CS = 45  # セルのサイズ
NUM_X = 12  # セルの個数
NUM_Y = 10  # セルの個数
SCR_X = CS * NUM_X  # スクリーンサイズ
SCR_Y = CS * NUM_Y  # スクリーンサイズ
START_X = 1
START_Y = 2
CS_COLOR = (255, 255, 255)

field0 = [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]
field1 = [3, 0, 2, 2, 2, 2, 3, 3, 3, 2, 2, 2, 3]
field2 = [3, 2, 2, 3, 2, 2, 2, 2, 2, 2, 3, 2, 3]
field3 = [3, 2, 3, 2, 3, 3, 3, 2, 3, 2, 2, 2, 3]
field4 = [3, 2, 2, 2, 3, 2, 2, 2, 3, 2, 3, 2, 3]
field5 = [3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 2, 2, 3]
field6 = [3, 2, 3, 2, 2, 2, 3, 2, 2, 2, 3, 2, 3]
field7 = [3, 2, 3, 2, 3, 2, 2, 2, 3, 2, 3, 2, 3]
field8 = [3, 2, 2, 2, 3, 2, 3, 2, 2, 2, 3, 1, 3]
field9 = [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

FIELD1 = [field0, field1, field2, field3, field4,
          field5, field6, field7, field8, field9]

FIELD2 = [field0, field1, field2, field3, field3,
          field5, field6, field2, field8, field9]


##########################################
# ファイル出力関係
##########################################
IMG_FILE = "image"
EXTENSION = ".jpeg"


##########################################
# 行動関係
##########################################

LEFT = 0
RIGHT = 1
UP = 2
DOWN = 3
DIRECTION = [LEFT, RIGHT, UP, DOWN]

